## Data merging

In [1]:
import pandas as pd
import numpy as np

In [2]:
#example datasets for data merging

data1 = {
    'id': [1,2,3],
    'naem': ['Ahmad', 'Fatima', 'Ali'],
    'age': [28, 32, 24]
}
data1 = pd.DataFrame(data1)

#Data set 2: Additional information
data2 = {
    'id': [1,2,3],
    'city': ['karachi', 'lahore', 'peshawar'],
    'occupation': ['engineer', 'doctor', 'teacher']
}
data2 = pd.DataFrame(data2)

data1.head()

   id    naem  age
0   1   Ahmad   28
1   2  Fatima   32
2   3     Ali   24

In [3]:
# merging Dataframe on 'id'
merged_data = pd.merge(data1, data2, on='id', how='inner')
merged_data

   id    naem  age      city occupation
0   1   Ahmad   28   karachi   engineer
1   2  Fatima   32    lahore     doctor
2   3     Ali   24  peshawar    teacher